app/controllers/api/v1/price_datas_controller.rb

    def index
        @price_datas = PriceData.all
---
SELECT "price_datas".* FROM "price_datas"