app/controllers/api/v1/stocks_controller.rb

def index
        @stocks = Stock.all
---
SELECT "stocks".* FROM "stocks"

    def create
        @stock = Stock.new(stock_params)
        if @stock.save
---
INSERT INTO "stocks" ("user_id", "name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "AAPL"], ["price", 400.0], ["created_at", "2018-11-12 14:19:48.506619"], ["updated_at", "2018-11-12 14:19:48.506619"]]

    def destroy
        @stock = Stock.find_by(id: params[:id])
        if @stock
            @stock.destroy()
---
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "stocks" WHERE "stocks"."id" = ?  [["id", 3]]