app/controllers/api/v1/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("username", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Adrian"], ["score", 0], ["created_at", "2018-11-12 14:18:15.607269"], ["updated_at", "2018-11-12 14:18:15.607269"]]